{"commands.category":"Anteprima dinamica","commands.startServer":"Avvia server","commands.showPreview":"Mostra anteprima","commands.showDebugPreview":"Mostra anteprima debug","commands.showPreviewExternalBrowser":"Mostra anteprima (browser esterno)","commands.showDebugPreviewExternalBrowser":"Mostra anteprima debug (browser esterno)","commands.showPreviewInternalBrowser":"Mostra anteprima (browser interno)","commands.openAutomaticallyOnServerStart":"Apri automaticamente all'avvio del server","commands.runServerLoggingTask":"Avvia registrazione server","commands.stopServer":"Arresta server","commands.startServerAtFileString":"Server iniziale alla stringa per percorso file","settings.portNumber":"Porta locale che il server dell'anteprima live deve provare inizialmente. Se questo numero di porta non funziona, incrementerà il numero di porta fino a quando non trova una porta libera.","settings.serverKeepAliveAfterEmbeddedPreviewClose":"Numero di minuti dopo la chiusura dell'anteprima incorporata che devono trascorrere prima che il server venga arrestato. Impostare su 0 per avere il server attivo a tempo indeterminato.","settings.previewDebounceDelay":"Numero di millisecondi di ritardo da usare per il debouncing dell'aggiornamento in anteprima.","settings.showServerStatusNotifications":"Indica se visualizzare o meno i messaggi informativi sulla modifica dello stato di attivazione/disattivazione del server.","settings.autoRefreshPreview":"Frequenza con cui aggiornare automaticamente l'anteprima.","settings.openPreviewTarget":"Destinazione preferita per le anteprime.","settings.notifyOnOpenLooseFile":"Indica se inviare una notifica all'utente all'apertura di un'anteprima per un file che non fa parte dell'area di lavoro attualmente aperta (o dell'area di lavoro in cui è ospitato il server).","settings.tasks.runTaskWithExternalPreview":"Indica se associare o meno istanze di anteprima esterne all'attività del server generata automaticamente. Se questa opzione è disabilitata, neanche il server verrà chiuso automaticamente (fino alla chiusura della finestra).","settings.defaultPreviewPath":"File da visualizzare automaticamente all'avvio del server. Lasciare vuoto per aprire in corrispondenza dell'indice.","settings.debugOnExternalPreview":"Indica se collegare o meno il debugger JavaScript all'avvio dell'anteprima esterna.","settings.serverRoot":"Percorso relativo dalla radice dell'area di lavoro da cui vengono serviti i file. I file verranno visualizzati in anteprima come se la radice dell'area di lavoro si trovasse in questo percorso relativo. Se questo percorso di directory non esiste nell'area di lavoro, verrà usata per impostazione predefinita la radice dell'area di lavoro. Questa impostazione si applica solo se è aperta un'area di lavoro.","settings.hostIP":"Indirizzo host IP locale in cui ospitare i file.","settings.customExternalBrowser":"Il browser da avviare quando si visualizza l'anteprima di un file in un browser esterno. Funziona solo per l'anteprima normale (non di debug) e funziona solo su desktop.","settings.httpHeaders":"Intestazioni HTTP aggiuntive che devono essere impostate nelle risposte HTTP del server.","tasks.workspacePathDesc":"Percorso dell'area di lavoro in cui si vuole avviare il server."}
