tap "1password/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "romkatv/powerlevel10k"
brew "ack"
brew "autoconf"
brew "automake"
brew "coreutils"
brew "libtool"
brew "libyaml"
brew "asdf"
brew "php", restart_service: true
brew "composer"
brew "cowsay"
brew "exa"
brew "ffmpeg"
brew "fortune"
brew "git"
brew "gnupg"
brew "neovim"
brew "node"
brew "nvm"
brew "pkg-config"
brew "the_silver_searcher"
brew "tmux"
brew "wget"
brew "zlib"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "romkatv/powerlevel10k/powerlevel10k"
cask "1password-cli"
cask "alt-tab"
cask "brave-browser"
cask "gimp"
cask "gqrx"
cask "hiddenbar"
cask "imageoptim"
cask "inkscape"
cask "insomnia"
cask "jumpcut"
cask "kap"
cask "keka"
cask "signal"
cask "slack"
cask "stats"
cask "sublime-text"
cask "telegram"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
vscode "aaron-bond.better-comments"
vscode "alexcvzz.vscode-sqlite"
vscode "aliariff.vscode-erb-beautify"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "angelomollame.conflict-squeezer"
vscode "antfu.icons-carbon"
vscode "burkeholland.simple-react-snippets"
vscode "christian-kohler.npm-intellisense"
vscode "ClemensPeters.format-json"
vscode "com-adobe-coldfusion.adobe-cfml-lsp"
vscode "DanishSarwar.reverse-search"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "DEVSENSE.phptools-vscode"
vscode "DEVSENSE.profiler-php-vscode"
vscode "donjayamanne.githistory"
vscode "DotJoshJohnson.xml"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "felipecaputo.git-project-manager"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "fortran-lang.linter-gfortran"
vscode "GitHub.github-vscode-theme"
vscode "golang.go"
vscode "HarryHopkinson.vs-code-runner"
vscode "ilich8086.coldfusion"
vscode "jnbt.vscode-rufo"
vscode "juliencroain.markdown-viewer"
vscode "mariusschulz.yarn-lock-syntax"
vscode "mrmlnc.vscode-postcss-sorting"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-typescript-next"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-sqlite"
vscode "naco-siren.gradle-language"
vscode "PKief.material-icon-theme"
vscode "PolymerMallard.css-alphabetize"
vscode "Prisma.prisma-insider"
vscode "qwtel.sqlite-viewer"
vscode "rebornix.ruby"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "REditorSupport.r"
vscode "richterger.perl"
vscode "ritwickdey.LiveServer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sidthesloth.html5-boilerplate"
vscode "stylelint.vscode-stylelint"
vscode "svelte.svelte-vscode"
vscode "syler.sass-indented"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "Vue.volar"
vscode "wingrunr21.vscode-ruby"
vscode "xdebug.php-debug"
vscode "xdebug.php-pack"
vscode "zhiyuan-lin.simple-perl"
