tap "1password/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "romkatv/powerlevel10k"
brew "ack"
brew "autoconf"
brew "automake"
brew "coreutils"
brew "libtool"
brew "libyaml"
brew "asdf"
brew "php", restart_service: true
brew "composer"
brew "cowsay"
brew "exa"
brew "ffmpeg"
brew "fortune"
brew "git"
brew "gnupg"
brew "neovim"
brew "node"
brew "nvm"
brew "pkg-config"
brew "the_silver_searcher"
brew "tmux"
brew "wget"
brew "zlib"
brew "zsh"
brew "romkatv/powerlevel10k/powerlevel10k"
cask "1password-cli"
cask "alt-tab"
cask "brave-browser"
cask "gimp"
cask "gqrx"
cask "hiddenbar"
cask "imageoptim"
cask "inkscape"
cask "insomnia"
cask "jumpcut"
cask "kap"
cask "keka"
cask "signal"
cask "slack"
cask "stats"
cask "sublime-text"
cask "telegram"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
vscode "antfu.icons-carbon"
vscode "christian-kohler.npm-intellisense"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "GitHub.github-vscode-theme"
vscode "mariusschulz.yarn-lock-syntax"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-typescript-next"
vscode "PKief.material-icon-theme"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.LiveServer"
vscode "sidthesloth.html5-boilerplate"
vscode "svelte.svelte-vscode"
vscode "Vue.volar"
vscode "wingrunr21.vscode-ruby"
vscode "xdebug.php-debug"
vscode "xdebug.php-pack"
