{"commands.category":"Canlı Önizleme","commands.startServer":"Sunucuyu Başlat","commands.showPreview":"Önizlemeyi Göster","commands.showDebugPreview":"Hata Ayıklama Önizlemesini Göster","commands.showPreviewExternalBrowser":"Önizlemeyi Göster (Dış Tarayıcı)","commands.showDebugPreviewExternalBrowser":"Hata Ayıklama Önizlemesini Göster (Dış Tarayıcı)","commands.showPreviewInternalBrowser":"Önizlemeyi Göster (İç Tarayıcı)","commands.openAutomaticallyOnServerStart":"Sunucu Başlangıcında Otomatik Olarak Aç","commands.runServerLoggingTask":"Sunucu Günlüğünü Başlat","commands.stopServer":"Sunucuyu durdur","commands.startServerAtFileString":"Dosya Yolu Dizesinde Sunucuyu Başlat","settings.portNumber":"Canlı önizleme sunucusunun başlangıçta hangi yerel bağlantı noktasını denemesi gerektiği. Bu bağlantı noktası numarası çalışmazsa, boş bir bağlantı noktası buluncaya kadar bağlantı noktası numarasını artırır.","settings.serverKeepAliveAfterEmbeddedPreviewClose":"Ekli önizleme kapatıldıktan sonra sunucunun kaç dakika içinde kapanmasını istediğiniz. Sunucunun süresiz olarak açık kalması için 0 olarak ayarlayın.","settings.previewDebounceDelay":"Önizleme güncelleştirmesinin geri dönüşü kaldırılırken kaç milisaniye gecikme kullanılacağı.","settings.showServerStatusNotifications":"Sunucunun açık/kapalı durum değişikliğinde bilgi iletilerinin gösterilip gösterilmeyeceği.","settings.autoRefreshPreview":"Önizlemenin otomatik olarak ne sıklıkta yenileneceği.","settings.openPreviewTarget":"Önizlemeler için tercih edilen hedef.","settings.notifyOnOpenLooseFile":"Şu anda açık olan çalışma alanının (veya sunucunun barındırıldığı çalışma alanının) parçası olmayan bir dosya için önizleme açılırken kullanıcıya bildirilip bildirilmeyeceği.","settings.tasks.runTaskWithExternalPreview":"Dış önizleme örneklerinin otomatik olarak oluşturulan sunucu göreviyle eşleştirilip eşleştirilmeyeceği. Devre dışı bırakıldığında, sunucu da otomatik olarak kapatılmaz (pencere kapatılana kadar).","settings.defaultPreviewPath":"Sunucu başlatılırken otomatik olarak gösterilecek dosya. Dizinde açmak için boş bırakın.","settings.debugOnExternalPreview":"Dış önizleme başlatmalarda JavaScript hata ayıklayıcısının eklenip eklenmeyeceği.","settings.serverRoot":"Dosyaların alındığı çalışma alanı kökünden göreli yol. Dosyalar, çalışma alanı kökü bu göreli yol içindeymiş gibi önizlenir. Bu dizin yolu çalışma alanınız içinde yoksa, varsayılan olarak çalışma alanı köküne göre oluşturulur. Bu ayar yalnızca açık bir çalışma alanınız varsa geçerlidir.","settings.hostIP":"Dosyalarınızın barındırılacağı yerel IP ana bilgisayar adresi.","settings.customExternalBrowser":"Dış tarayıcıda bir dosyanın önizlemesini görüntülemek için başlatmak istediğiniz tarayıcı. Yalnızca normal önizleme için (hata ayıklama dışı) ve yalnızca masaüstünde kullanılabilir.","settings.httpHeaders":"Sunucunun HTTP yanıtlarında ayarlanması gereken ek HTTP üst bilgileri.","tasks.workspacePathDesc":"Sunucuyu başlatmak istediğiniz çalışma alanının yolu."}
