{"commands.category":"Visualização Dinâmica","commands.startServer":"Iniciar Servidor","commands.showPreview":"Mostrar Versão prévia","commands.showDebugPreview":"Mostrar Visualização de Depuração","commands.showPreviewExternalBrowser":"Mostrar Versão Prévia (Navegador Externo)","commands.showDebugPreviewExternalBrowser":"Mostrar Versão prévia de Depuração (Navegador Externo)","commands.showPreviewInternalBrowser":"Mostrar versão prévia (Navegador Interno)","commands.openAutomaticallyOnServerStart":"Abrir Automaticamente ao Iniciar o Servidor","commands.runServerLoggingTask":"Iniciar Log do Servidor","commands.stopServer":"Interromper Servidor","commands.startServerAtFileString":"Iniciar servidor na cadeia de caracteres do caminho do arquivo","settings.portNumber":"Qual porta local o servidor da visualização dinâmica deve tentar inicialmente. Se esse número de porta não funcionar, ele incrementará o número da porta até encontrar uma porta livre.","settings.serverKeepAliveAfterEmbeddedPreviewClose":"Quantos minutos após fechar a visualização incorporada, você deseja que o servidor seja desligado. Defina como 0 para que o servidor permaneça ligado indefinidamente.","settings.previewDebounceDelay":"Quantos milissegundos de atraso usar ao debounce a atualização de visualização.","settings.showServerStatusNotifications":"Se as mensagens de informações no servidor devem ou não ser exibidas no status ativado/desativado.","settings.autoRefreshPreview":"Com que frequência atualizar automaticamente a visualização.","settings.openPreviewTarget":"O destino preferencial para visualizações.","settings.notifyOnOpenLooseFile":"Se o usuário deve ser notificado ao abrir uma visualização de um arquivo que não faz parte do espaço de trabalho aberto no momento (ou do espaço de trabalho em que o servidor está hospedado).","settings.tasks.runTaskWithExternalPreview":"Se as instâncias de visualização externas devem ou não ser emparelhadas com a tarefa de servidor gerada automaticamente. Quando desabilitado, o servidor também não fechará automaticamente (até que a janela seja fechada).","settings.defaultPreviewPath":"O arquivo a ser exibido automaticamente ao iniciar o servidor. Deixe em branco para abrir no índice.","settings.debugOnExternalPreview":"Se o depurador JavaScript deve ou não ser anexado nas inicializações de visualização externa.","settings.serverRoot":"O caminho relativo da raiz do workspace do qual os arquivos são servidos. Os arquivos serão pré-visualizados como se a raiz do workspace estiver neste caminho relativo. Se este caminho de diretório não existir no workspace, ele usará como padrão a raiz do workspace. Esta configuração só se aplica se você tiver um workspace aberto.","settings.hostIP":"O endereço do host IP local para hospedar seus arquivos.","settings.customExternalBrowser":"O navegador que você deseja iniciar ao pré-visualizar um arquivo em um navegador externo. Funciona apenas para pré-visualização normal (sem depuração) e só funciona em computador desktop.","settings.httpHeaders":"Os cabeçalhos HTTP extras que devem ser definidos nas respostas HTTP do servidor.","tasks.workspacePathDesc":"O caminho do workspace no qual você deseja iniciar o servidor."}
