{"commands.category":"Podgląd na żywo","commands.startServer":"Uruchom serwer","commands.showPreview":"Pokaż podgląd","commands.showDebugPreview":"Pokaż podgląd debugowania","commands.showPreviewExternalBrowser":"Pokaż podgląd (przeglądarka zewnętrzna)","commands.showDebugPreviewExternalBrowser":"Pokaż podgląd debugowania (przeglądarka zewnętrzna)","commands.showPreviewInternalBrowser":"Pokaż podgląd (przeglądarka wewnętrzna)","commands.openAutomaticallyOnServerStart":"Otwórz automatycznie przy uruchomieniu serwera","commands.runServerLoggingTask":"Uruchom rejestrowanie serwera","commands.stopServer":"Zatrzymaj serwer","commands.startServerAtFileString":"Uruchom serwer w ciągu ścieżki pliku","settings.portNumber":"Który port lokalny powinien zostać początkowo wypróbowany przez serwer podglądu na żywo. Jeśli ten numer portu nie zadziała, numer portu zostanie zwiększony do momentu znalezienia wolnego portu.","settings.serverKeepAliveAfterEmbeddedPreviewClose":"Ile minut po zamknięciu osadzonej wersji zapoznawczej serwer ma zostać wyłączony. Ustaw wartość 0, aby serwer pozostał włączony na czas nieokreślony.","settings.previewDebounceDelay":"Ile milisekund opóźnienia należy użyć podczas debugowania aktualizacji w wersji zapoznawczej.","settings.showServerStatusNotifications":"Określa, czy komunikaty informacyjne na serwerze mają być wyświetlane w przypadku zmiany stanu włączania/wyłączania.","settings.autoRefreshPreview":"Częstotliwość automatycznego odświeżania wersji zapoznawczej.","settings.openPreviewTarget":"Preferowany element docelowy dla wersji zapoznawczych.","settings.notifyOnOpenLooseFile":"Określa, czy powiadamiać użytkownika podczas otwierania podglądu pliku, który nie jest częścią obecnie otwartego obszaru roboczego (lub obszaru roboczego, w którym jest hostowany serwer).","settings.tasks.runTaskWithExternalPreview":"Określa, czy sparować zewnętrzne wystąpienia w wersji zapoznawczej z automatycznie wygenerowanym zadaniem serwera. Po wyłączeniu serwer również nie zostanie automatycznie zamknięty (dopóki okno nie zostanie zamknięte).","settings.defaultPreviewPath":"Plik, który ma być automatycznie wyświetlany po uruchomieniu serwera. Pozostaw to pole puste, aby otworzyć w indeksie.","settings.debugOnExternalPreview":"Określa, czy dołączyć debuger JavaScript przy uruchamianiu zewnętrznej wersji zapoznawczej.","settings.serverRoot":"Ścieżka względna z katalogu głównego obszaru roboczego, z których są obsługiwane pliki. Podgląd plików będzie wyświetlany tak, jakby katalog główny obszaru roboczego był w tej ścieżce względnej. Jeśli ta ścieżka katalogu nie istnieje w Twoim obszarze roboczym, domyślnie zostanie użyty katalog główny obszaru roboczego. To ustawienie ma zastosowanie tylko wtedy, gdy obszar roboczy jest otwarty.","settings.hostIP":"Lokalny adres hosta IP do hostowania plików.","settings.customExternalBrowser":"Przeglądarka, którą chcesz uruchomić podczas wyświetlania podglądu pliku w zewnętrznej przeglądarce. Działa tylko w przypadku normalnej wersji zapoznawczej (bez debugowania). Wybierz pozycję „Brak”, aby użyć domyślnej przeglądarki.","settings.httpHeaders":"Dodatkowe nagłówki HTTP, które powinny być ustawione w odpowiedziach HTTP serwera.","tasks.workspacePathDesc":"Identyfikator URI obszaru roboczego, w którym chcesz uruchomić serwer."}
